# Taps
tap "netbirdio/tap"

# CLI Tools
brew "coreutils"
brew "fzf"
brew "gh"
brew "httpie"
brew "jq"
brew "stow"           # Required for dotfiles management
brew "tree"
brew "unar"
brew "wget"

# Shell
brew "starship"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Development
brew "bun"
brew "docker"
brew "git-delta"
brew "go"
brew "kubectl"
brew "kubectx"
brew "node"
brew "python@3.11"
brew "shellcheck"
brew "uv"

# Apps
cask "1password"
cask "arc"
cask "discord"
cask "ghostty"
cask "gpg-suite"
cask "insomnia"
cask "mac-mouse-fix"
cask "maccy"
cask "netbird-ui"
brew "netbirdio/tap/netbird"
cask "nordvpn"
cask "rectangle"
cask "tableplus"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
