tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/versions"
tap "caskroom/fonts"

# Binaries
brew "antibody"
brew "coreutils"
brew "aws-iam-authenticator"
brew "awscli"
brew "fzf"
brew "gh"
brew "go"
brew "httpie"
brew "jq"
brew "python"
brew "thefuck"
brew "tree"
brew "unar"
brew "wget"

# Apps
cask '1password'
cask 'discord'
cask 'rancher' # Replacement for Docker Desktop
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'maccy'
cask 'signal'
cask 'slack'
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'tableplus'
cask "rectangle"
cask 'zoom'
cask 'protonmail-bridge'
cask 'spotify'
cask 'obsidian'
