tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/versions"
tap "caskroom/fonts"

# Binaries
brew "antibody"
brew "coreutils"
brew "aws-iam-authenticator"
brew "awscli"
brew "fzf"
brew "gh"
brew "go"
brew "httpie"
brew "jq"
brew "python"
brew "thefuck"
brew "tree"
brew "unar"
brew "wget"

# Apps
cask '1password'
cask 'discord'
cask 'rancher' # Replacement for Docker Desktop=
cask 'gpg-suite'
cask 'insomnia' # HTTP client
cask 'maccy' # Copy history
cask 'signal' # Messaging app
cask 'slack' # Company messaging app
cask 'tunnelbear' # VPN
cask 'visual-studio-code' # Coding
cask 'tableplus' # Database client
cask "rectangle" # Window manager
cask 'zoom'
cask 'protonmail-bridge'
cask 'spotify' # Music 🎶
cask 'obsidian' # Note taking
cask 'warp' # Terminal
cask 'google-chrome'
cask 'microsoft-edge'
