tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/bundle"
tap "homebrew/core"
tap 'netbirdio/tap/netbird'

# Binaries
brew "coreutils"
brew "fzf"
brew "gh"
brew "httpie"
brew "jq"
brew "python"
brew "tree"
brew "unar"
brew "wget"
brew "kubectl"
brew "kubectx"

# Modern development tools
brew 'docker'
brew "bat" # Better cat
brew "exa" # Modern ls replacement
brew "fd" # Fast find alternative
brew "ripgrep" # Fast grep alternative
brew "tldr" # Simplified man pages
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship" # Modern shell prompt

# Security and networking
brew "openssl"
brew "nmap"
brew "wireshark"
brew "gpg"

# Development utilities
brew "git-delta" # Better git diff
brew "git-lfs"
brew "pre-commit"
brew "shellcheck" # Shell script linting

# Apps
cask "rectangle" # Window manager
cask 'maccy' # Copy history
cask 'insomnia' # HTTP client
cask 'gpg-suite'
cask 'discord'
cask 'warp' # Terminal
cask 'firefox' # Browser
cask 'cursor' # Coding
cask 'protonmail-bridge'
cask 'spotify' # Music 🎶
cask 'nordvpn' # VPN
cask 'tableplus' # Database client
cask 'whatsapp' # WhatsApp
cask 'netbird-ui' # Netbird
brew 'mac-mouse-fix' # MacOS mouse fix

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
